import React from 'react'

const Agreements = () => (
  <div className="apply-agreements">
    <h1>咨询师入驻协议</h1>
    <p>
      智心理对入驻的咨询师有着严格的职业要求及审核标准，请在开始申请入驻之前，仔细阅读《智心理咨询师入驻标准》以及下方的协议说明
    </p>
    <h2>协议内容</h2>
    <p>
      （一）本协议内容包括协议正文以及所有本网站已经发布的或将来可能发布的各类规则、通知、公告等。所有规则为协议不可分割的组成部分，与协议正文具有同等法律效力。智心理将就网站制定特别规则（下称"特别规则"），如特别规则与网站其他规则存在冲突，则以特别规则为准。
    </p>
    <p>
      （二）咨询师在使用本网站提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。智心理有权根据需要不时地制定、修改本协议和/或各类规则，如有任何变更，智心理将在网站、APP等以公示的方式进行公告，不再单独通知每个咨询师。变更后的协议和规则一经公布即自动生效，成为本协议的一部分。如咨询师不同意相关变更，应当立即以书面通知的方式终止本协议；任何修订和新规则一经在网站上公布即自动生效，成为本协议的一部分。如咨询师登录或继续使用服务的，则视为对修改后的协议和规则不持异议并同意遵守。除另行明确声明外，任何使服务范围扩大或功能增强的新内容均受本协议约束。
    </p>
    <p>
      （三）智心理保留在任何时候自行决定对服务及其相关功能、应用软件变更、升级的权利。智心理进一步保留在服务中开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件服务的提供，除非智心理另有说明，否则仍适用本协议。服务随时可能因智心理的单方判断而被增加或修改，或因定期、不定期的维护而暂缓提供，咨询师将会得到相应的变更通知。咨询师在此同意智心理在任何情况下都无需向其或第三方在使用服务时对其在传输或联络中的迟延、不准确、错误或疏漏及因此而致使的损害负责。
    </p>
  </div>
)

export default Agreements
